Repository: hananmalik21/digify_hr_system
Catalog: lib/core/localization/l10n/app_*.arb
Languages: ar

source: vacant
ar: شاغر

source: Filled
ar: مشغول

source: Title (English)
ar: المسمى (إنجليزي)

source: Title (Arabic)
ar: المسمى (عربي)

# reportingStructureDescription
source: Tabular view of position reporting relationships and hierarchy
ar: عرض جدولي لعلاقات الإبلاغ والتسلسل الهرمي للوظائف

source: Export Table
ar: تصدير الجدول

source: With Reports
ar: مع تقارير

source: Position Title
ar: المسمى الوظيفي

source: Direct Reports
ar: التقارير المباشرة

source: No reports
ar: لا توجد تقارير

source: View Reports
ar: عرض التقارير

source: Position Types
ar: أنواع الوظائف

source: Top Level Positions
ar: وظائف المستوى الأعلى

source: No reporting manager
ar: لا يوجد مدير للإبلاغ

source: Management Positions
ar: الوظائف الإدارية

source: Has direct reports
ar: لديه تقارير مباشرة

source: Individual Contributors
ar: المساهمون الفرديون

source: No direct reports
ar: لا توجد تقارير مباشرة

source: Position Details
ar: تفاصيل الوظيفة

source: Organizational Information
ar: معلومات تنظيمية

source: Job Classification
ar: تصنيف الوظيفة

source: Headcount Information
ar: معلومات الموارد البشرية

source: Salary Information
ar: معلومات الراتب

source: Reporting Relationship
ar: علاقات التقارير

source: Employment Type
ar: نوع التوظيف

source: Budgeted Min
ar: الحد الأدنى المدرج

source: Budgeted Max
ar: الحد الأقصى المدرج

source: Actual Average
ar: المتوسط الفعلي

source: Step
ar: الخطوة

source: Delete Job Level
ar: حذف مستوى الوظيفة

# deleteJobLevelConfirmationMessage
source: Are you sure you want to delete this job level? This action cannot be undone.
ar: هل أنت متأكد من رغبتك في حذف مستوى الوظيفة هذا؟ لا يمكن التراجع عن هذا الإجراء.

source: Job level created successfully
ar: تم إنشاء مستوى الوظيفة بنجاح

source: Job level updated successfully
ar: تم تحديث مستوى الوظيفة بنجاح

source: Job level deleted successfully
ar: تم حذف مستوى الوظيفة بنجاح

# errorCreatingJobLevel
source: An error occurred while creating the job level
ar: حدث خطأ أثناء إنشاء مستوى الوظيفة

# errorDeletingJobLevel
source: An error occurred while deleting the job level
ar: حدث خطأ أثناء حذف مستوى الوظيفة

# manageShiftsWorkPatterns
source: Manage shifts, work patterns, schedules, and assignments
ar: إدارة الورديات وأنماط العمل والجداول والتعيينات

source: Shifts
ar: الورديات

source: Work Patterns
ar: أنماط العمل

source: Add Work Pattern
ar: إضافة نمط عمل

source: Create Work Pattern
ar: إنشاء نمط عمل

source: Work Schedules
ar: جداول العمل

# createWorkSchedule
source: Create Schedule
ar: إنشاء جدول

source: Schedule Assignments
ar: تعيينات الجدول

source: View Calendar
ar: عرض التقويم

source: Public Holidays
ar: العطلات الرسمية

source: Delete Permanently
ar: حذف نهائي

# deleteStructureTitle
source: Delete Organization Structure
ar: حذف هيكل المؤسسة

# cascadeDeleteWarning
source: This action will permanently delete the organization structure and all associated organizational units.
ar: سيؤدي هذا الإجراء إلى حذف هيكل المؤسسة وجميع الوحدات التنظيمية المرتبطة به بشكل دائم.

# cascadeDeleteDetails
source: The structure "{structureName}" has {orgUnitsCount} organizational unit(s) that will be deleted. This action cannot be undone.
ar: يحتوي الهيكل "{structureName}" على {orgUnitsCount} وحدة تنظيمية سيتم حذفها. لا يمكن التراجع عن هذا الإجراء.

# deleteStructureMessage
source: Are you sure you want to proceed?
ar: هل أنت متأكد أنك تريد المتابعة؟

# structureReferencedError
source: Cannot delete organization structure: This structure is referenced by other records in the database.
ar: لا يمكن حذف هيكل المؤسسة: هذا الهيكل مستخدم في سجلات أخرى في قاعدة البيانات.

# structureDeletedSuccess
source: Organization structure deleted successfully.
ar: تم حذف هيكل المؤسسة بنجاح.

# confirmDeleteStructure
source: Are you sure you want to delete this structure?
ar: هل أنت متأكد أنك تريد حذف هذا الهيكل؟

# structureHasOrgUnits
source: This structure has {count} organizational unit(s) that reference it. You must delete all organizational units first, or use cascade delete.
ar: يحتوي هذا الهيكل على {count} وحدة تنظيمية تشير إليه. يجب حذف جميع الوحدات التنظيمية أولاً، أو استخدام الحذف المتتالي.

# somethingWentWrong
source: Something went wrong. Please try again.
ar: حدث خطأ ما. يرجى المحاولة مرة أخرى.

source: Retry
ar: إعادة المحاولة

source: Leave Requests
ar: طلبات الإجازة

# leaveRequestsDescription
source: Submit and approve requests
ar: تقديم والموافقة على الطلبات

source: Leave Balance
ar: رصيد الإجازة

# leaveBalanceDescription
source: View and manage employee leave balances and accruals
ar: عرض وإدارة أرصدة إجازات الموظفين والاستحقاقات

source: My Leave Balance
ar: رصيد إجازتي

# myLeaveBalanceDescription
source: View your leave balances, carry forward, and forfeit information
ar: عرض أرصدة إجازاتك ونقلها وقواعد الإسقاط

source: Apply Leave
ar: تقديم طلب إجازة

source: Request Encashment
ar: طلب صرف نقدي

source: Employee Name
ar: اسم الموظف

source: Employee Number
ar: رقم الموظف

source: Join Date
ar: تاريخ الانضمام

source: Total Balance
ar: الرصيد الإجمالي

source: days available
ar: أيام متاحة

source: Current Year
ar: السنة الحالية

source: Carried Forward
ar: منقول

source: Carry Forward Allowed
ar: السماح بالنقل

source: At Risk
ar: في خطر

source: At-Risk (Forfeitable)
ar: في خطر (قابل للإسقاط)

source: Encashment Available
ar: الصرف النقدي متاح

# requestEncashmentButton
source: Request →
ar: طلب →

# encashmentDescription
source: You can request to encash unused leave days for monetary compensation
ar: يمكنك طلب صرف أيام الإجازة غير المستخدمة مقابل تعويض مالي

# atRiskDescription
source: These days exceed the carry forward limit and will be forfeited after {date}
ar: هذه الأيام تتجاوز حد النقل وسيتم إسقاطها بعد {date}

source: Hajj Leave
ar: إجازة الحج

source: Compassionate Leave
ar: إجازة التعاطف

source: Kuwait Labor Law Leave Policy
ar: سياسة الإجازة بموجب قانون العمل الكويتي

# carryForwardPolicy
source: Carry Forward
ar: النقل

# carryForwardPolicyDescription
source: Annual leave can be carried forward subject to Kuwait Labor Law regulations and company policy limits
ar: يمكن نقل الإجازة السنوية وفقًا لقواعد قانون العمل الكويتي وحدود سياسة الشركة

source: Forfeit Rules
ar: قواعد الإسقاط

# forfeitRulesDescription
source: Leave days exceeding carry forward limits will be forfeited at the end of the grace period
ar: سيتم إسقاط أيام الإجازة التي تتجاوز حدود النقل في نهاية فترة السماح

# encashmentPolicy
source: Encashment
ar: الصرف النقدي

# encashmentPolicyDescription
source: Eligible leave types can be encashed subject to manager approval and company policy
ar: يمكن صرف أنواع الإجازات المؤهلة بموافقة المدير وسياسة الشركة

# teamLeaveRiskDescription
source: Team absence risk analysis
ar: تحليل مخاطر غياب الفريق

source: Leave Policies
ar: سياسات الإجازة

# leavePoliciesDescription
source: Kuwait Labor Law policies
ar: سياسات قانون العمل الكويتي

source: Policy Configuration
ar: تكوين السياسة

# policyConfigurationDescription
source: Configure leave eligibility
ar: تكوين أهلية الإجازة

source: Add New Policy
ar: إضافة سياسة جديدة

source: Forfeit Policy
ar: سياسة الإسقاط

# forfeitPolicyDescription
source: Leave forfeit rules
ar: قواعد إسقاط الإجازة

# forfeitProcessing
source: Leave Forfeit Processing
ar: معالجة إسقاط الإجازات

# forfeitProcessingDescription
source: Process automatic leave forfeit for employees exceeding carry forward limits
ar: معالجة إسقاط الإجازات التلقائي للموظفين الذين يتجاوزون حدود التحويل

source: Forfeit Reports
ar: تقارير الإسقاط

# forfeitReportsDescription
source: Forfeit analytics
ar: تحليلات الإسقاط

source: Leave Calendar
ar: تقويم الإجازة

# leaveCalendarDescription
source: Team absence calendar
ar: تقويم غياب الفريق

# manageEmployeeLeaveRequests
source: Manage employee leave requests according to Kuwait Labor Law
ar: إدارة طلبات إجازة الموظفين وفقًا لقانون العمل الكويتي

source: New Leave Request
ar: طلب إجازة جديد

source: Kuwait Labor Law Leave Entitlements
ar: استحقاقات الإجازة بموجب قانون العمل الكويتي

# annualLeaveEntitlement
source: 30 days per year after 1 year of service
ar: 30 يومًا سنويًا بعد سنة واحدة من الخدمة

# sickLeaveEntitlement
source: 15 days full pay + 10 days half pay + 10 days unpaid
ar: 15 يومًا براتب كامل + 10 أيام بنصف راتب + 10 أيام بدون راتب

# maternityLeaveEntitlement
source: 70 days total (30 before, 40 after delivery)
ar: 70 يومًا إجمالي (30 قبل الولادة، 40 بعد الولادة)

# emergencyLeaveEntitlement
source: 5 days per year for emergencies
ar: 5 أيام سنويًا للطوارئ

# leaveFilterAll
source: all
ar: الكل

# leaveFilterDraft
source: draft
ar: مسودة

# leaveFilterPending
source: pending
ar: قيد الانتظار

# leaveFilterApproved
source: approved
ar: موافق عليه

# leaveFilterRejected
source: rejected
ar: مرفوض

source: Employee
ar: الموظف

source: Leave Type
ar: نوع الإجازة

source: Days
ar: الأيام

source: Reason
ar: السبب

source: Maternity Leave
ar: إجازة أمومة

source: Rejected
ar: مرفوض

source: Reject
ar: رفض

source: Leave Request Guidelines
ar: إرشادات طلب الإجازة

# submitRequests3DaysAdvance
source: • Submit requests at least 3 days in advance for annual leave
ar: • تقديم الطلبات قبل 3 أيام على الأقل للإجازة السنوية

# sickLeaveRequiresCertificate
source: • Sick leave requires medical certificate if more than 3 days
ar: • إجازة المرض تتطلب شهادة طبية إذا كانت أكثر من 3 أيام

# ensureWorkHandover
source: • Ensure work handover is completed before leave starts
ar: • التأكد من اكتمال تسليم العمل قبل بدء الإجازة

source: Type to search employees...
ar: اكتب للبحث عن الموظفين...

# leaveTypeRequired
source: Leave Type
ar: نوع الإجازة

source: Annual Leave (Paid Vacation)
ar: الإجازة السنوية (إجازة مدفوعة)

source: Regular paid vacation leave
ar: إجازة مدفوعة منتظمة

source: Maximum: 30 days per year
ar: الحد الأقصى: 30 يومًا في السنة

source: Start Time
ar: وقت البدء

source: End Time
ar: وقت الانتهاء

source: Full Day
ar: يوم كامل

source: Previous
ar: السابق

source: Next
ar: التالي

# completeAllStepsToSubmit
source: Complete all steps to submit your leave application
ar: أكمل جميع الخطوات لتقديم طلب الإجازة

source: Leave Details
ar: تفاصيل الإجازة

source: Contact & Notes
ar: جهات الاتصال والملاحظات

source: Documents & Review
ar: المستندات والمراجعة

source: Reason for Leave
ar: سبب الإجازة

# pleaseProvideDetailedReason
source: Please provide a detailed reason for your leave request...
ar: يرجى تقديم سبب مفصل لطلب الإجازة...

# charactersCount
source: {count}/500 characters
ar: {count}/500 حرف

source: Work Delegated To
ar: العمل المفوض إلى

# selectColleagueToHandleWork
source: Select colleague to handle your work...
ar: اختر زميلًا للتعامل مع عملك...

# selectColleagueWhoWillHandle
source: Select a colleague who will handle your responsibilities during your absence
ar: اختر زميلًا سيتعامل مع مسؤولياتك أثناء غيابك

source: Contact Information During Leave
ar: معلومات الاتصال أثناء الإجازة

source: Address During Leave
ar: العنوان أثناء الإجازة

# enterAddressOrLocation
source: Enter your address or location during leave...
ar: أدخل عنوانك أو موقعك أثناء الإجازة...

source: Contact Phone Number
ar: رقم هاتف الاتصال

source: Emergency Contact Name
ar: اسم جهة الاتصال الطارئة

source: Enter emergency contact name
ar: أدخل اسم جهة الاتصال الطارئة

source: Emergency Contact Phone
ar: هاتف جهة الاتصال الطارئة

source: Additional Notes
ar: ملاحظات إضافية

# anyAdditionalInformation
source: Any additional information or special considerations...
ar: أي معلومات إضافية أو اعتبارات خاصة...

source: Supporting Documents
ar: المستندات الداعمة

# clickToUploadOrDragDrop
source: Click to upload or drag and drop
ar: انقر للتحميل أو السحب والإفلات

# pdfDocDocxJpgPngUpTo10MB
source: PDF, DOC, DOCX, JPG, PNG up to 10MB each
ar: PDF، DOC، DOCX، JPG، PNG حتى 10 ميجابايت لكل منها

source: Required Documents:
ar: المستندات المطلوبة:

source: • Supporting documents (if applicable)
ar: • المستندات الداعمة (إن وجدت)

source: Request Summary
ar: ملخص الطلب

source: Attachments
ar: المرفقات

# filesCount
source: {count} file(s)
ar: {count} ملف (ملفات)

source: Declaration
ar: الإقرار

# declarationText
source: By submitting this leave request, I confirm that all information provided is accurate and complete. I understand that providing false information may result in disciplinary action. I have completed necessary work handover and informed relevant parties about my absence.
ar: بإرسال طلب الإجازة هذا، أؤكد أن جميع المعلومات المقدمة دقيقة وكاملة. أفهم أن تقديم معلومات خاطئة قد يؤدي إلى إجراءات تأديبية. لقد أكملت تسليم العمل اللازم وأبلغت الأطراف المعنية بغيابي.

source: Submit Request
ar: إرسال الطلب

source: Save as draft
ar: حفظ كمسودة

source: Draft saved
ar: تم حفظ المسودة

source: Not selected
ar: غير محدد

source: Team Leave Risk
ar: مخاطر إجازة الفريق

source: Team Leave Risk Dashboard
ar: لوحة تحكم مخاطر إجازة الفريق

# monitorAndManageTeamMembersAtRisk
source: Monitor and manage team members at risk of leave forfeit
ar: مراقبة وإدارة أعضاء الفريق المعرضين لخطر فقدان الإجازة

source: Team Members
ar: أعضاء الفريق

source: Active employees
ar: الموظفون النشطون

source: Employees at Risk
ar: الموظفون المعرضون للخطر

source: Total At-Risk Days
ar: إجمالي الأيام المعرضة للخطر

source: Across all team members
ar: عبر جميع أعضاء الفريق

source: Avg At-Risk per Employee
ar: متوسط المخاطر لكل موظف

source: Days per employee
ar: أيام لكل موظف

source: Filters
ar: المرشحات

source: All Leave Types
ar: جميع أنواع الإجازة

source: Export Report
ar: تصدير التقرير

source: Employees with At-Risk Leave
ar: الموظفون ذوو إجازة معرضة للخطر

source: At-Risk Days
ar: أيام الخطر

source: Carry Forward Limit
ar: حد التحويل

source: Risk Level
ar: مستوى الخطر

# daysLeft
source: {count} days left
ar: بقي {count} أيام

source: High
ar: عالي

source: Low
ar: منخفض

source: Medium
ar: متوسط

source: Manager Action Recommendations
ar: توصيات إجراءات المدير

source: Encourage Leave Planning
ar: تشجيع تخطيط الإجازة

# encourageLeavePlanningDescription
source: Proactively discuss leave plans with team members who have high at-risk balances
ar: مناقشة خطط الإجازة بشكل استباقي مع أعضاء الفريق الذين لديهم أرصدة عالية المعرضة للخطر

source: Approve Pending Requests
ar: الموافقة على الطلبات المعلقة

# approvePendingRequestsDescription
source: Review and approve pending leave requests to help employees utilize their balance
ar: مراجعة والموافقة على طلبات الإجازة المعلقة لمساعدة الموظفين على استخدام رصيدهم

source: Encashment Option
ar: خيار التحصيل

# encashmentOptionDescription
source: Consider approving encashment requests for employees who cannot take leave
ar: النظر في الموافقة على طلبات التحصيل للموظفين الذين لا يمكنهم أخذ إجازة
