Repository: hananmalik21/digify_hr_system
Catalog: lib/core/localization/l10n/app_*.arb
Languages: ar

# appTitle
source: Digify ERP
ar: ديجيفاي ERP

source: Welcome
ar: مرحباً

source: Login
ar: تسجيل الدخول

source: Sign In
ar: تسجيل الدخول

source: Sign Up
ar: إنشاء حساب

source: Email
ar: البريد الإلكتروني

source: Password
ar: كلمة المرور

source: Confirm Password
ar: تأكيد كلمة المرور

source: Full Name
ar: الاسم الكامل

source: Phone Number
ar: رقم الهاتف

source: Forgot Password?
ar: نسيت كلمة المرور؟

# dontHaveAccount
source: Don't have an account?
ar: ليس لديك حساب؟

# alreadyHaveAccount
source: Already have an account?
ar: لديك حساب بالفعل؟

# emailHint
source: Enter your email
ar: أدخل بريدك الإلكتروني

# passwordHint
source: Enter your password
ar: أدخل كلمة المرور

# confirmPasswordHint
source: Confirm your password
ar: أكد كلمة المرور

# usernameHint
source: Enter your username
ar: أدخل اسم المستخدم

source: Welcome Back
ar: مرحباً بعودتك

# signInToAccessDashboard
source: Sign in to access your HR dashboard
ar: قم بتسجيل الدخول للوصول إلى لوحة تحكم الموارد البشرية

source: Demo Credentials:
ar: بيانات تجريبية:

source: Reset Demo Users
ar: إعادة تعيين المستخدمين التجريبيين

# copyrightText
source: © 2024 Digify HR. Kuwait Labor Law Compliant.
ar: © 2024 ديجيفاي للموارد البشرية. متوافق مع قانون العمل الكويتي.

source: Kuwait Labor Law Compliant
ar: متوافق مع قانون العمل الكويتي

# digifyHrTitle
source: Digify HR
ar: ديجيفاي للموارد البشرية

# systemDescription
source: Comprehensive Human Resource Management System with advanced security and compliance features.
ar: نظام شامل لإدارة الموارد البشرية مع ميزات أمان وامتثال متقدمة.

source: Complete HR Suite
ar: مجموعة الموارد البشرية الكاملة

# completeHrSuiteDescription
source: 19 integrated modules managing all aspects of human resources
ar: 19 وحدة متكاملة تدير جميع جوانب الموارد البشرية

source: Advanced Security
ar: الأمان المتقدم

# advancedSecurityDescription
source: Role-based access control with 60+ security functions
ar: التحكم في الوصول القائم على الأدوار مع أكثر من 60 وظيفة أمان

source: Kuwait Compliance
ar: الامتثال الكويتي

# kuwaitComplianceDescription
source: Fully compliant with Kuwait Labor Law No. 6/2010
ar: متوافق بالكامل مع قانون العمل الكويتي رقم 6/2010

source: Real-time Analytics
ar: التحليلات في الوقت الفعلي

# realTimeAnalyticsDescription
source: Comprehensive reporting and analytics dashboard
ar: لوحة تقارير وتحليلات شاملة

# invalidCredentials
source: Invalid email or password. Please try again.
ar: البريد الإلكتروني أو كلمة المرور غير صحيحة. يرجى المحاولة مرة أخرى.

# fullNameHint
source: Enter your full name
ar: أدخل اسمك الكامل

# phoneHint
source: Enter your phone number
ar: أدخل رقم هاتفك

# loginSuccess
source: Login successful!
ar: تم تسجيل الدخول بنجاح!

# signupSuccess
source: Sign up successful!
ar: تم إنشاء الحساب بنجاح!

source: Please wait...
ar: يرجى الانتظار...

# invalidEmail
source: Please enter a valid email
ar: يرجى إدخال بريد إلكتروني صحيح

# passwordTooShort
source: Password must be at least 6 characters
ar: يجب أن تكون كلمة المرور 6 أحرف على الأقل

source: Passwords do not match
ar: كلمات المرور غير متطابقة

# fieldRequired
source: This field is required
ar: هذا الحقل مطلوب

source: Home
ar: الرئيسية

source: Enterprise Structure
ar: هيكل المؤسسة

source: General Ledger
ar: دفتر الأستاذ العام

source: Chart of Accounts
ar: دليل الحسابات

source: Journal Entries
ar: قيود اليومية

source: Account Balances
ar: أرصدة الحسابات

source: Intercompany Accounting
ar: المحاسبة بين الشركات

source: Budget Management
ar: إدارة الموازنة

source: Financial Report Sets
ar: مجموعات التقارير المالية

source: Accounts Payable
ar: الحسابات الدائنة

source: Accounts Receivable
ar: الحسابات المدينة

source: Cash Management
ar: إدارة النقدية

source: Fixed Assets
ar: الأصول الثابتة

source: Treasury
ar: الخزينة

source: Expense Management
ar: إدارة المصروفات

source: Financial Reporting
ar: التقارير المالية

source: Period Close
ar: إقفال الفترة

source: Workflow Approvals
ar: الموافقات

source: Security Console
ar: وحدة الأمان

source: Security Dashboard
ar: لوحة الأمان

source: User Accounts
ar: حسابات المستخدمين

# userAccountsSubtitle
source: Manage user accounts and permissions
ar: إدارة حسابات المستخدمين والصلاحيات

source: User Role Assignment
ar: تعيين أدوار المستخدمين

source: Role Management
ar: إدارة الأدوار

source: Roles
ar: الأدوار

source: Role Hierarchy
ar: تسلسل الأدوار

source: Role Templates
ar: قوالب الأدوار

source: Data Security
ar: أمان البيانات

source: Security Policies
ar: سياسات الأمان

source: Data Access Sets
ar: مجموعات الوصول للبيانات

source: Security Profiles
ar: ملفات الأمان

source: Function Privileges
ar: صلاحيات الوظائف

source: Duty Roles
ar: أدوار الواجبات

source: Job Roles
ar: أدوار الوظائف

source: Audit & Compliance
ar: التدقيق والامتثال

source: Audit Logs
ar: سجلات التدقيق

source: Login History
ar: سجل تسجيل الدخول

source: Access Reports
ar: تقارير الوصول

source: Compliance Reports
ar: تقارير الامتثال

source: Session Management
ar: إدارة الجلسات

source: Security Reports
ar: تقارير الأمان

source: Data Security & Privacy
ar: أمن البيانات والخصوصية

source: Security Reports & Analytics
ar: تقارير الأمان والتحليلات

source: Dashboard
ar: لوحة التحكم

source: Logout
ar: تسجيل الخروج

source: Settings
ar: الإعدادات

source: Profile
ar: الملف الشخصي

source: Notifications
ar: الإشعارات

source: Help
ar: المساعدة

source: About
ar: حول

source: Security Overview
ar: نظرة عامة على الأمان

source: Total Users
ar: إجمالي المستخدمين

source: Active Users
ar: المستخدمون النشطون

source: Inactive Users
ar: المستخدمون غير النشطين

source: Pending Approvals
ar: الموافقات المعلقة

source: Total Roles
ar: إجمالي الأدوار

source: Active Roles
ar: الأدوار النشطة

source: Custom Roles
ar: الأدوار المخصصة

source: Standard Roles
ar: الأدوار القياسية

source: Total Privileges
ar: إجمالي الصلاحيات

source: Active
ar: نشط

source: Inactive
ar: غير نشط

source: Role Usage
ar: استخدام الأدوار

source: Modules
ar: الوحدات

source: Recent Security Alerts
ar: تنبيهات الأمان الأخيرة

source: Failed Login Attempts
ar: محاولات تسجيل دخول فاشلة

# unauthorizedAccess
source: Unauthorized Access Attempt
ar: محاولة وصول غير مصرح بها

# passwordExpiringUsers
source: Password Expiring for Multiple Users
ar: انتهاء صلاحية كلمة المرور لعدة مستخدمين

# unusualActivity
source: Unusual Activity Detected
ar: تم اكتشاف نشاط غير عادي

source: Investigate All
ar: التحقيق في الكل

# minutesAgo
source: {count} minutes ago
ar: منذ {count} دقيقة

# hoursAgo
source: {count} hours ago
ar: منذ {count} ساعة

# daysAgo
source: {count} days ago
ar: منذ {count} يوم

source: Recent Activity
ar: النشاط الأخير

# userCreated
source: User account created
ar: تم إنشاء حساب مستخدم

# roleModified
source: Role permissions modified
ar: تم تعديل أذونات الدور

# policyUpdated
source: Security policy updated
ar: تم تحديث سياسة الأمان

source: Privileges revoked
ar: تم إلغاء الصلاحيات

source: View All
ar: عرض الكل

source: Quick Actions
ar: إجراءات سريعة

source: Create User
ar: إنشاء مستخدم

source: Assign Role
ar: تعيين دور

source: Review Access
ar: مراجعة الوصول

source: Generate Report
ar: إنشاء تقرير

source: System Compliance Status
ar: حالة امتثال النظام

source: User Authentication
ar: مصادقة المستخدم

source: Data Encryption
ar: تشفير البيانات

source: Access Control
ar: التحكم في الوصول

source: Audit Logging
ar: سجل التدقيق

source: Active Sessions
ar: الجلسات النشطة

source: Pending Reviews
ar: المراجعات المعلقة

source: Critical Alerts
ar: التنبيهات الحرجة

source: Search accounts...
ar: البحث في الحسابات...

source: All Types
ar: جميع الأنواع

source: All Status
ar: جميع الحالات

source: More Filters
ar: المزيد من الفلاتر

source: Administrator
ar: مدير

source: Standard User
ar: مستخدم قياسي

source: Finance User
ar: مستخدم مالي

source: Manager
ar: المدير

source: Active (2FA)
ar: نشط (2FA)

source: Enabled
ar: مفعّل

source: Disabled
ar: معطّل

source: View
ar: عرض

source: Edit
ar: تعديل

source: Refresh
ar: تحديث

source: Lock
ar: قفل

source: Create Account
ar: إنشاء حساب

# showingResults
source: Showing {count} of {total} accounts
ar: عرض {count} من {total} حساب

source: Account Details
ar: تفاصيل الحساب

source: User Information
ar: معلومات المستخدم

source: User ID
ar: معرّف المستخدم

source: Email Address
ar: عنوان البريد الإلكتروني

source: Department
ar: القسم

source: Position
ar: المنصب

source: Account Status
ar: حالة الحساب

source: MFA Status
ar: حالة MFA

source: Security Information
ar: معلومات الأمان

source: Assigned Roles
ar: الأدوار المعينة

source: Last Login
ar: آخر تسجيل دخول

source: Account Created
ar: تاريخ إنشاء الحساب

source: Password Last Changed
ar: آخر تغيير لكلمة المرور

source: Failed Attempts
ar: المحاولات الفاشلة

# sessionHistory
source: Session History (Last 7 days)
ar: سجل الجلسات (آخر 7 أيام)

source: Date
ar: التاريخ

source: IP Address
ar: عنوان IP

source: Device
ar: الجهاز

source: Location
ar: الموقع

source: Duration
ar: المدة

source: Close
ar: إغلاق

source: Save Changes
ar: حفظ التغييرات

source: Manage Roles
ar: إدارة الأدوار

source: Search users...
ar: البحث عن المستخدمين...

source: Role
ar: الدور

source: Refresh User
ar: تحديث المستخدم

source: Manage User Roles
ar: إدارة أدوار المستخدم

source: Logged In User
ar: المستخدم المسجل

# rolesLoadedSuccessfully
source: {count} roles loaded successfully
ar: تم تحميل {count} دور بنجاح

source: Currently Assigned Roles
ar: الأدوار المعينة حالياً

source: Available Roles to Assign
ar: الأدوار المتاحة للتعيين

source: Search roles...
ar: البحث عن الأدوار...

source: Assign Selected
ar: تعيين المحدد

source: Remove Selected
ar: إزالة المحدد

source: No roles assigned
ar: لا توجد أدوار معينة

# noRolesAvailable
source: No available roles
ar: لا توجد أدوار متاحة

# rolesAssignedLabel
source: Roles Assigned
ar: الأدوار المعينة

# rolesAvailableLabel
source: Roles Available
ar: الأدوار المتاحة

source: Role Assignment History
ar: سجل تعيين الأدوار

source: Assigned By
ar: تم التعيين بواسطة

source: Assigned On
ar: تاريخ التعيين

source: Status
ar: الحالة

source: Cancel
ar: إلغاء

source: Save Updates
ar: حفظ التحديثات

source: Unsaved Changes
ar: تغييرات غير محفوظة

source: No recent activity
ar: لا يوجد نشاط حديث

# userRoleAssignmentSubtitle
source: Assign and manage security roles for users
ar: تعيين وإدارة أدوار الأمان للمستخدمين

source: Users with Roles
ar: المستخدمون بأدوار

# avgRolesPerUser
source: Avg Roles/User
ar: متوسط الأدوار/المستخدم

source: Available Roles
ar: الأدوار المتاحة

source: Refresh Data
ar: تحديث البيانات

source: Total Assignments
ar: إجمالي التعيينات

source: Roles in Use
ar: الأدوار قيد الاستخدام

source: Users with Multiple Roles
ar: المستخدمون بأدوار متعددة

source: Username
ar: اسم المستخدم

source: Current Roles
ar: الأدوار الحالية

source: Actions
ar: الإجراءات

# roleManagementSubtitle
source: Manage roles, permissions, and access levels
ar: إدارة الأدوار والأذونات ومستويات الوصول

# dutyRolesOnly
source: Duty Roles
ar: أدوار الواجبات

source: Standard
ar: قياسي

source: Custom
ar: مخصص

# allTypesFilter
source: All Types
ar: جميع الأنواع

# allStatusFilter
source: All Status
ar: جميع الحالات

# searchRolesPlaceholder
source: Search roles by name or code...
ar: البحث عن الأدوار بالاسم أو الرمز...

source: Role Type
ar: نوع الدور

# usersAssigned
source: Users Assigned ({count})
ar: المستخدمون المعينون ({count})

source: Privileges
ar: الصلاحيات

source: Created On
ar: تاريخ الإنشاء

source: Create Role
ar: إنشاء دور

source: Create New Role
ar: إنشاء دور جديد

source: Edit Role
ar: تعديل الدور

source: Role Information
ar: معلومات الدور

source: Role Name
ar: اسم الدور

source: Enter role name
ar: أدخل اسم الدور

source: Role Code
ar: رمز الدور

# enterRoleCode
source: Enter role code (e.g., FIN_MGR_001)
ar: أدخل رمز الدور (مثل: FIN_MGR_001)

source: Role Description
ar: وصف الدور

source: Enter role description
ar: أدخل وصف الدور

source: Role Configuration
ar: تكوين الدور

source: Select Role Type
ar: اختر نوع الدور

source: Job Role
ar: دور وظيفي

source: Duty Role
ar: دور واجب

source: Effective Dates
ar: تواريخ السريان

source: Start Date
ar: تاريخ البدء

source: End Date
ar: تاريخ الانتهاء

source: Set Active Status
ar: تعيين الحالة النشطة

source: Set Status
ar: تعيين الحالة

# privilegesAndAccess
source: Privileges & Access
ar: الصلاحيات والوصول

source: Function Security
ar: أمان الوظائف

source: Function
ar: الوظيفة

source: Access Level
ar: مستوى الوصول

source: Add Privilege
ar: إضافة صلاحية

source: Data Access Set
ar: مجموعة الوصول للبيانات

source: Assign Data Sets
ar: تعيين مجموعات البيانات

source: Role created successfully
ar: تم إنشاء الدور بنجاح

source: Role updated successfully
ar: تم تحديث الدور بنجاح

source: Create
ar: إنشاء

source: Update
ar: تحديث

# roleHierarchySubtitle
source: View and manage role hierarchy structure
ar: عرض وإدارة هيكل التسلسل الهرمي للأدوار

source: Total Nodes
ar: إجمالي العقد

source: Max Depth
ar: أقصى عمق

source: Parent Roles
ar: الأدوار الأم

source: Parent Role
ar: الدور الأم

source: Select type
ar: اختر النوع

source: Child Roles
ar: الأدوار الفرعية

source: Search hierarchy...
ar: البحث في التسلسل...

source: Expand All
ar: توسيع الكل

source: Collapse All
ar: طي الكل

source: Create Root Role
ar: إنشاء دور جذري

# usersAssignedLabel
source: Users Assigned
ar: المستخدمون المعينون

source: No results found
ar: لم يتم العثور على نتائج

# tryAdjustingSearchCriteria
source: Try adjusting your search criteria
ar: حاول تعديل معايير البحث

source: Add Role to Hierarchy
ar: إضافة دور إلى التسلسل

# selectParentRole
source: Select Parent Role (Optional)
ar: اختر الدور الأم (اختياري)

# selectParent
source: Select parent role...
ar: اختر الدور الأم...

# noParentRole
source: No Parent (Root Level)
ar: بدون دور أم (المستوى الجذر)

source: Existing Role
ar: دور موجود

source: Select existing role
ar: اختر دوراً موجوداً

source: New Role Name
ar: اسم الدور الجديد

source: Enter new role name
ar: أدخل اسم الدور الجديد

# roleTypeLabel
source: Role Type
ar: نوع الدور

source: Add Role
ar: إضافة دور

# roleTemplatesSubtitle
source: Pre-configured role templates for quick setup
ar: قوالب أدوار مُعدة مسبقاً للإعداد السريع

source: Total Templates
ar: إجمالي القوالب

source: Industry Specific
ar: خاص بالصناعة

source: Recently Used
ar: المستخدم مؤخراً

source: Categories
ar: الفئات

source: Category
ar: الفئة

source: Finance
ar: المالية

source: Operations
ar: العمليات

source: HR
ar: الموارد البشرية

source: IT
ar: تكنولوجيا المعلومات

source: Import
ar: استيراد

source: Create Template
ar: إنشاء قالب

source: Use Template
ar: استخدام القالب

source: Includes
ar: يتضمن

# privilegesCount
source: {count} Privileges
ar: {count} صلاحية

# dataSetsCount
source: {count} Data Sets
ar: {count} مجموعة بيانات

source: Create New Template
ar: إنشاء قالب جديد

source: Creating Template
ar: جاري إنشاء القالب

# templateInstructions
source: Create a reusable role template with pre-configured permissions and access settings
ar: إنشاء قالب دور قابل لإعادة الاستخدام مع الأذونات وإعدادات الوصول المُعدة مسبقاً

source: Template Name
ar: اسم القالب

source: Enter template name
ar: أدخل اسم القالب

source: Template Code
ar: رمز القالب

# enterTemplateCode
source: Enter unique template code
ar: أدخل رمز القالب الفريد

source: Select Category
ar: اختر الفئة

source: Template Description
ar: وصف القالب

source: Enter template description
ar: أدخل وصف القالب

source: Included Privileges
ar: الصلاحيات المضمنة

source: Select Privileges
ar: اختر الصلاحيات

# selectedPrivileges
source: {count} selected
ar: تم اختيار {count}

source: Included Data Sets
ar: مجموعات البيانات المضمنة

source: Select Data Sets
ar: اختر مجموعات البيانات

# selectedDataSets
source: {count} selected
ar: تم اختيار {count}

source: Make Default Template
ar: جعله القالب الافتراضي

# setAsDefault
source: Set as default for this category
ar: تعيين كافتراضي لهذه الفئة

# createTemplateButton
source: Create Template
ar: إنشاء القالب

# securityPoliciesSubtitle
source: Configure and manage security policies
ar: تكوين وإدارة سياسات الأمان

source: Active Policies
ar: السياسات النشطة

source: Pending Review
ar: قيد المراجعة

source: Expiring Soon
ar: تنتهي قريباً

source: Search policies...
ar: البحث عن السياسات...

source: Create Policy
ar: إنشاء سياسة

source: Policy Type
ar: نوع السياسة

source: Enforcement Level
ar: مستوى التطبيق

source: Last Modified
ar: آخر تعديل

source: Expiry Date
ar: تاريخ الانتهاء

source: Create New Policy
ar: إنشاء سياسة جديدة

source: Edit Policy
ar: تعديل السياسة

source: Creating Policy
ar: جاري إنشاء السياسة

# policyInstructions
source: Define security policies to enforce access control and compliance
ar: تحديد سياسات الأمان لفرض التحكم في الوصول والامتثال

source: Policy Name
ar: اسم السياسة

source: Enter policy name
ar: أدخل اسم السياسة

source: Policy Code
ar: رمز السياسة

source: Enter policy code
ar: أدخل رمز السياسة

source: Policy Description
ar: وصف السياسة

source: Enter policy description
ar: أدخل وصف السياسة

source: Select Policy Type
ar: اختر نوع السياسة

source: Password Policy
ar: سياسة كلمة المرور

source: Access Policy
ar: سياسة الوصول

source: Compliance Policy
ar: سياسة الامتثال

source: Select Enforcement Level
ar: اختر مستوى التطبيق

source: Mandatory
ar: إلزامي

source: Recommended
ar: موصى به

source: Optional
ar: اختياري

source: Enter expiry date
ar: أدخل تاريخ الانتهاء

source: Policy Rules
ar: قواعد السياسة

source: Add Rule
ar: إضافة قاعدة

# createPolicyButton
source: Create Policy
ar: إنشاء السياسة

# dataAccessSetsSubtitle
source: Manage data access sets and permissions
ar: إدارة مجموعات الوصول للبيانات والأذونات

source: Total Data Access Sets
ar: إجمالي مجموعات الوصول

source: Ledger Based
ar: على أساس دفتر الأستاذ

source: Entity Based
ar: على أساس الكيان

source: Search data access sets...
ar: البحث عن مجموعات الوصول...

source: Create Data Access Set
ar: إنشاء مجموعة وصول

source: Access Scope
ar: نطاق الوصول

source: Create New Data Access Set
ar: إنشاء مجموعة وصول جديدة

source: Creating Data Access Set
ar: جاري إنشاء مجموعة الوصول

# dataAccessSetInstructions
source: Define data access boundaries for controlling which data users can view and modify
ar: تحديد حدود الوصول للبيانات للتحكم في البيانات التي يمكن للمستخدمين عرضها وتعديلها

source: Set Name
ar: اسم المجموعة

source: Enter data access set name
ar: أدخل اسم مجموعة الوصول

source: Set Code
ar: رمز المجموعة

source: Enter set code
ar: أدخل رمز المجموعة

source: Access Type
ar: نوع الوصول

source: Data Access Configuration
ar: تكوين الوصول للبيانات

source: Access Criteria (Choose One)
ar: معايير الوصول (اختر واحداً)

source: Select access criteria
ar: اختر معايير الوصول

# ledgersSelected
source: {count} Ledgers Selected
ar: تم اختيار {count} دفتر أستاذ

source: No ledgers found
ar: لم يتم العثور على دفاتر أستاذ

# legalEntitiesSelected
source: {count} Legal Entities Selected
ar: تم اختيار {count} كيان قانوني

source: No legal entities found
ar: لم يتم العثور على كيانات قانونية

source: Create Set
ar: إنشاء المجموعة

source: Edit Data Access Set
ar: تعديل مجموعة الوصول

source: Update Set
ar: تحديث المجموعة

# enterDescription
source: Enter description (optional)
ar: أدخل الوصف (اختياري)

source: No data access sets found
ar: لم يتم العثور على مجموعات وصول

# tryAdjustingFilters
source: Try adjusting your filters or search criteria
ar: حاول تعديل الفلاتر أو معايير البحث

source: No policies found
ar: لم يتم العثور على سياسات

source: No templates found
ar: لم يتم العثور على قوالب

source: No roles found
ar: لم يتم العثور على أدوار

source: No users found
ar: لم يتم العثور على مستخدمين

source: No privileges found
ar: لم يتم العثور على صلاحيات

# functionPrivilegesSubtitle
source: Manage function-level security privileges
ar: إدارة صلاحيات الأمان على مستوى الوظائف

source: Create Privilege
ar: إنشاء صلاحية

source: Search privileges...
ar: البحث عن الصلاحيات...

source: All
ar: الكل

# usedInRolesCount
source: Used in {count} roles
ar: مستخدم في {count} دور

# functionArea
source: Function
ar: الوظيفة

# actionType
source: Operation
ar: العملية

# selectActionType
source: Select Operation
ar: اختر العملية

source: Select Status
ar: اختر الحالة

# createPrivilegeTitle
source: Create Function Privilege
ar: إنشاء صلاحية وظيفة

# editPrivilegeTitle
source: Edit Function Privilege
ar: تعديل صلاحية الوظيفة

source: Privilege Name
ar: اسم الصلاحية

source: Enter privilege name
ar: أدخل اسم الصلاحية

source: Privilege Code
ar: رمز الصلاحية

source: Enter privilege code
ar: أدخل رمز الصلاحية

# privilegeDescription
source: Description
ar: الوصف

source: Select Module
ar: اختر الوحدة

source: Privilege created successfully
ar: تم إنشاء الصلاحية بنجاح

source: Privilege updated successfully
ar: تم تحديث الصلاحية بنجاح

source: Module
ar: الوحدة

source: Privilege
ar: الصلاحية

source: Root Roles
ar: الأدوار الجذرية

source: Hierarchy Structure
ar: هيكل التسلسل الهرمي

source: Save Role
ar: حفظ الدور

source: Basic Information
ar: المعلومات الأساسية

source: Please enter role name
ar: الرجاء إدخال اسم الدور

source: Please enter role code
ar: الرجاء إدخال رمز الدور

source: Description
ar: الوصف

source: Priority
ar: الأولوية

source: Active Role
ar: دور نشط

source: Assign Privileges
ar: تعيين الصلاحيات

source: Functions
ar: الوظائف

source: Security Incidents
ar: الحوادث الأمنية

source: Security Alerts
ar: تنبيهات الأمان

source: Recent Security Activities
ar: الأنشطة الأمنية الأخيرة

source: Configure Data Security
ar: تكوين أمان البيانات

source: View Audit Logs
ar: عرض سجلات التدقيق

source: Password Policy Compliance
ar: امتثال سياسة كلمة المرور

source: Multi-Factor Authentication
ar: المصادقة متعددة العوامل

source: Active User Review
ar: مراجعة المستخدم النشط

source: Segregation of Duties
ar: فصل المهام

source: Compliance Status
ar: حالة الامتثال

source: Passwords Expiring
ar: كلمات المرور المنتهية

source: Compliance Score
ar: درجة الامتثال

source: Tasks & Events
ar: المهام والأحداث

source: Attendance & Leaves
ar: الحضور والإجازات

source: MY TASKS
ar: مهامي

source: UPCOMING EVENTS
ar: الأحداث القادمة

# reviewLeaveRequests
source: Review pending leave requests
ar: مراجعة طلبات الإجازة المعلقة

source: Due today
ar: مستحقة اليوم

source: Process monthly payroll
ar: معالجة كشوف المرتبات الشهرية

source: Due in 3 days
ar: مستحقة خلال 3 أيام

source: Update employee records
ar: تحديث سجلات الموظفين

source: Completed
ar: مكتمل

source: Team Meeting
ar: اجتماع الفريق

source: Payroll Processing
ar: معالجة كشوف المرتبات

source: All-day
ar: طوال اليوم

source: View All Tasks & Events
ar: عرض جميع المهام والأحداث

source: TODAY'S ATTENDANCE
ar: حضور اليوم

source: Check In Time
ar: وقت تسجيل الدخول

# statusOnTime
source: On Time
ar: في الوقت المحدد

source: MY UPCOMING LEAVES
ar: إجازاتي القادمة

source: Annual Leave
ar: الإجازة السنوية

# leaveDates
source: Dec 25 - Dec 30, 2024
ar: 25 ديسمبر - 30 ديسمبر 2024

source: Approved
ar: موافق عليه

source: Approve
ar: موافقة

source: TEAM ON LEAVE TODAY
ar: الفريق في إجازة اليوم

source: Ahmad Hassan
ar: أحمد حسن

source: Sick Leave
ar: إجازة مرضية

source: Mohammed Khan
ar: محمد خان

source: Emergency Leave
ar: إجازة طارئة

source: View Full Calendar
ar: عرض التقويم الكامل

source: Admin User
ar: مستخدم الإدارة

# welcomeAdmin
source: Welcome, Admin User
ar: مرحباً، مستخدم الإدارة

source: Time Management
ar: إدارة الوقت

source: Leave Management
ar: إدارة الإجازات

source: Workforce Structure
ar: هيكل القوى العاملة

source: EOS Calculator
ar: حاسبة نهاية الخدمة

source: Government Forms
ar: النماذج الحكومية

source: HR Operations
ar: عمليات الموارد البشرية

source: DEI Dashboard
ar: لوحة DEI

source: Module Catalogue
ar: كتالوج الوحدات

source: Product Introduction
ar: مقدمة المنتج

source: Employees
ar: الموظفون

source: Attendance
ar: الحضور

source: Payroll
ar: كشوف المرتبات

source: Compliance
ar: الامتثال

source: Reports
ar: التقارير
