Repository: hananmalik21/digify_hr_system
Catalog: lib/core/localization/l10n/app_*.arb
Languages: ar

source: Manage Enterprise Structure
ar: إدارة هيكل المؤسسة

# configureManageHierarchy
source: Configure and manage your organizational hierarchy structures
ar: تكوين وإدارة هياكل التسلسل الهرمي للمؤسسة

source: Currently Active Structure
ar: الهيكل النشط حاليًا

source: Standard Kuwait Corporate Structure
ar: الهيكل المؤسسي الكويتي القياسي

# traditionalHierarchicalStructure
source: Traditional hierarchical structure with all five levels for comprehensive organizational management
ar: هيكل هرمي تقليدي بجميع المستويات الخمسة للإدارة التنظيمية الشاملة

source: Active Levels
ar: المستويات النشطة

source: Components
ar: المكونات

source: Employees Assigned
ar: الموظفون المعينون

source: Total Structures
ar: إجمالي الهياكل

source: Active Structure
ar: الهيكل النشط

source: Components in Use
ar: المكونات قيد الاستخدام

source: Structure Configurations
ar: تكوينات الهيكل

# manageDifferentConfigurations
source: Manage different organizational hierarchy configurations. Only one can be active at a time.
ar: إدارة تكوينات التسلسل الهرمي التنظيمي المختلفة. يمكن تنشيط واحد فقط في كل مرة.

source: Create New Structure
ar: إنشاء هيكل جديد

source: Hierarchy
ar: التسلسل الهرمي

source: levels
ar: مستويات

source: Created
ar: تم الإنشاء

source: Updated
ar: تم التحديث

source: Modified
ar: تم التعديل

source: Duplicate
ar: نسخ

source: Activate
ar: تفعيل

source: Delete
ar: حذف

source: NOT USED
ar: غير مستخدم

source: Simplified Structure
ar: هيكل مبسط

# streamlinedStructure
source: Streamlined structure for smaller organizations - Company, Division, and Department only
ar: هيكل مبسط للمؤسسات الصغيرة - الشركة والقسم والإدارة فقط

source: Flat Organization Structure
ar: هيكل تنظيمي مسطح

# minimalHierarchy
source: Minimal hierarchy for startups and agile teams - Company and Department only
ar: تسلسل هرمي minimal للشركات الناشئة والفرق الرشيقة - الشركة والإدارة فقط

# currentlyActiveStructureMessage
source: This is the currently active structure. To activate a different structure, click the "Activate" button on another configuration.
ar: هذا هو الهيكل النشط حاليًا. لتفعيل هيكل مختلف، انقر فوق زر "تفعيل" في تكوين آخر.

source: Company
ar: الشركة

source: Companies
ar: الشركات

source: Division
ar: القسم

source: Divisions
ar: الأقسام

source: Business Unit
ar: وحدة الأعمال

source: Business Units
ar: وحدات الأعمال

source: Departments
ar: الإدارات

source: Section
ar: القسم

source: Sections
ar: الأقسام

source: Company Code
ar: رمز الشركة

source: Company Name (English)
ar: اسم الشركة (بالإنجليزية)

source: Company Name (Arabic)
ar: اسم الشركة (بالعربية)

source: Legal Name (English)
ar: الاسم القانوني (بالإنجليزية)

source: Legal Name (Arabic)
ar: الاسم القانوني (بالعربية)

source: Industry
ar: الصناعة

source: Country
ar: البلد

source: City
ar: المدينة

source: Address
ar: العنوان

source: P.O. Box
ar: ص.ب

source: Zip Code
ar: الرمز البريدي

source: Website
ar: الموقع الإلكتروني

source: Currency
ar: العملة

# fiscalYearStart
source: Fiscal Year Start (MM-DD)
ar: بداية السنة المالية (شهر-يوم)

source: Phone
ar: الهاتف

source: View Enterprise Structure Configuration
ar: عرض تكوين هيكل المؤسسة

# reviewOrganizationalHierarchy
source: Review organizational hierarchy levels and sequence
ar: مراجعة مستويات التسلسل الهرمي التنظيمي والتسلسل

source: Structure Configuration Active
ar: تكوين الهيكل نشط

# enterpriseStructureActiveMessage
source: Your enterprise structure hierarchy is configured and active. You can modify the levels and order below.
ar: تم تكوين التسلسل الهرمي لهيكل المؤسسة الخاص بك وهو نشط. يمكنك تعديل المستويات والترتيب أدناه.

source: Configuration Instructions
ar: تعليمات التكوين

# companyMandatoryInstruction
source: Company is mandatory and must be the top level - it cannot be disabled or reordered
ar: الشركة إلزامية ويجب أن تكون المستوى الأعلى - لا يمكن تعطيلها أو إعادة ترتيبها

# enableDisableLevelsInstruction
source: Enable or disable levels based on your organizational needs
ar: تمكين أو تعطيل المستويات حسب احتياجاتك التنظيمية

# useArrowsInstruction
source: Use the up/down arrows to change the hierarchy sequence
ar: استخدم الأسهم لأعلى/لأسفل لتغيير تسلسل التسلسل الهرمي

# orderDeterminesRelationshipsInstruction
source: The order determines parent-child relationships in your org structure
ar: يحدد الترتيب العلاقات بين الوالدين والطفل في هيكلك التنظيمي

# changesAffectComponentsInstruction
source: Changes will affect how components are created and displayed in the tree view
ar: ستؤثر التغييرات على كيفية إنشاء المكونات وعرضها في عرض الشجرة

source: Preview Structure
ar: معاينة الهيكل

source: Save Configuration
ar: حفظ التكوين

source: Organizational Hierarchy Levels
ar: مستويات التسلسل الهرمي التنظيمي

source: Reset to Default
ar: إعادة تعيين إلى الافتراضي

source: Hierarchy Preview
ar: معاينة التسلسل الهرمي

source: Configuration Summary
ar: ملخص التكوين

source: Total Levels
ar: إجمالي المستويات

source: Hierarchy Depth
ar: عمق التسلسل الهرمي

source: Top Level
ar: المستوى الأعلى

source: Edit Enterprise Structure Configuration
ar: تعديل تكوين هيكل المؤسسة

# defineOrganizationalHierarchy
source: Define your organizational hierarchy levels and sequence
ar: حدد مستويات التسلسل الهرمي التنظيمي وتسلسلها

source: Create Enterprise Structure Configuration
ar: إنشاء تكوين هيكل المؤسسة

source: No Configuration Found
ar: لم يتم العثور على تكوين

# pleaseConfigureEnterpriseStructure
source: Please configure your enterprise structure hierarchy before creating components.
ar: يرجى تكوين التسلسل الهرمي لهيكل مؤسستك قبل إنشاء المكونات.

source: Structure Name
ar: اسم الهيكل

# structureNamePlaceholder
source: e.g., Standard Corporate Structure, Simplified Structure
ar: مثال: هيكل الشركة القياسي، هيكل مبسط

# descriptionPlaceholder
source: Describe this structure configuration and when it should be used...
ar: اوصف تكوين هذا الهيكل ومتى يجب استخدامه...

source: Manage Component Values
ar: إدارة قيم المكونات

# manageOrganizationalHierarchy
source: Manage organizational hierarchy and structure
ar: إدارة الهيكل التنظيمي والهيكل

source: Structure Configuration
ar: تكوين الهيكل

source: Organizational Tree Structure
ar: هيكل الشجرة التنظيمية

# componentValuesSubtitle
source: Create and manage organizational components (Company, Division, Business Unit, Department, Section)
ar: إنشاء وإدارة المكونات التنظيمية (الشركة، القسم، وحدة الأعمال، الإدارة، القسم)

source: Add New Component
ar: إضافة مكون جديد

source: Bulk Upload
ar: رفع مجمع

# bulkUploadTitle
source: Bulk Upload - Enterprise Structure Components
ar: رفع مجمع - مكونات الهيكل المؤسسي

# bulkUploadInstructionsTitle
source: Upload Instructions
ar: تعليمات التحميل

# bulkUploadInstructionDownloadTemplate
source: Download the template file to see the required format
ar: قم بتنزيل ملف القالب لمعرفة التنسيق المطلوب

# bulkUploadInstructionRequiredFields
source: Fill in all required fields: Type, Code, Name, Name Arabic, Parent Code (if applicable)
ar: املأ كافة الحقول الإلزامية: النوع، الرمز، الاسم، الاسم العربي، رمز الأب (إن وجد)

# bulkUploadInstructionOptionalFields
source: Optional fields: Manager ID, Cost Center, Location, Description
ar: الحقول الاختيارية: معرف المدير، مركز التكلفة، الموقع، الوصف

# bulkUploadInstructionParentCode
source: Parent Code must match an existing component code
ar: يجب أن يطابق رمز الأب رمز مكون موجود

# bulkUploadInstructionFileFormat
source: File format: Excel (.xlsx) or CSV (.csv)
ar: تنسيق الملف: Excel (.xlsx) أو CSV (.csv)

# bulkUploadInstructionRowLimit
source: Maximum 1000 rows per upload
ar: الحد الأقصى 1000 صف لكل تحميل

# bulkUploadStepDownloadLabel
source: Step 1: Download Template
ar: الخطوة 1: تنزيل القالب

# bulkUploadDownloadTemplate
source: Download Excel Template
ar: تنزيل قالب Excel

# bulkUploadStepUploadLabel
source: Step 2: Upload Filled Template
ar: الخطوة 2: تحميل القالب المعبأ

# bulkUploadDropHint
source: Drag and drop your file here, or click to browse
ar: قم بسحب وإفلات ملفك هنا، أو انقر للتصفح

# bulkUploadSupportedFormats
source: Supports: .xlsx, .csv (Max size: 10MB)
ar: يدعم: .xlsx، .csv (الحد الأقصى: 10 ميغابايت)

# bulkUploadTemplatePreview
source: Template Format Preview
ar: معاينة تنسيق القالب

# bulkUploadTypeHeader
source: Type
ar: النوع

# bulkUploadCodeHeader
source: Code
ar: الرمز

# bulkUploadNameHeader
source: Name
ar: الاسم

# bulkUploadNameArabicHeader
source: Name Arabic
ar: الاسم بالعربية

# bulkUploadParentCodeHeader
source: Parent Code
ar: رمز الأب

# bulkUploadManagerIdHeader
source: Manager ID
ar: معرف المدير

# bulkUploadLocationHeader
source: Location
ar: الموقع

# bulkUploadSampleRow1Type
source: company
ar: شركة

# bulkUploadSampleRow1Name
source: Main Company
ar: الشركة الرئيسية

# bulkUploadSampleRow1Location
source: Kuwait City
ar: مدينة الكويت

# bulkUploadSampleRow2Type
source: division
ar: قسم

# bulkUploadSampleRow2Name
source: Finance Division
ar: قسم المالية

# bulkUploadSampleRow2Location
source: Kuwait City HQ
ar: مقر الكويت

# bulkUploadUploadButton
source: Upload & Process
ar: تحميل ومعالجة

source: Export
ar: تصدير

# searchComponents
source: Search by name, code, or Arabic name...
ar: البحث بالاسم أو الرمز أو الاسم العربي...

source: Component Type
ar: نوع المكون

# componentCode
source: Code
ar: الرمز

# componentName
source: Name
ar: الاسم

source: Arabic Name
ar: الاسم العربي

# parentComponent
source: Parent
ar: الأصل

source: Last Updated
ar: آخر تحديث

source: Create Component
ar: إنشاء مكون

source: Edit Component
ar: تعديل مكون

source: View Component
ar: عرض مكون

source: Delete Component
ar: حذف مكون

source: Tree View
ar: عرض الشجرة

source: List View
ar: عرض القائمة

source: No components found
ar: لم يتم العثور على مكونات

# confirmDeleteComponent
source: Are you sure you want to delete this component?
ar: هل أنت متأكد من حذف هذا المكون؟

# componentTypeRequired
source: Component type is required
ar: نوع المكون مطلوب

# componentCodeRequired
source: Component code is required
ar: رمز المكون مطلوب

# componentNameRequired
source: Component name is required
ar: اسم المكون مطلوب

# arabicNameRequired
source: Arabic name is required
ar: الاسم العربي مطلوب

source: Select component type
ar: اختر نوع المكون

source: Enter component code
ar: أدخل رمز المكون

source: Enter component name
ar: أدخل اسم المكون

source: Enter Arabic name
ar: أدخل الاسم العربي

# selectParentComponent
source: Select parent component (optional)
ar: اختر المكون الأصل (اختياري)

source: Select manager
ar: اختر المدير

source: Enter location
ar: أدخل الموقع

source: Component created successfully
ar: تم إنشاء المكون بنجاح

source: Component updated successfully
ar: تم تحديث المكون بنجاح

source: Component deleted successfully
ar: تم حذف المكون بنجاح

# bulkUploadInstructions
source: Upload a CSV file with component data. Download the template for the correct format.
ar: قم برفع ملف CSV يحتوي على بيانات المكونات. قم بتنزيل القالب للحصول على التنسيق الصحيح.

source: Download Template
ar: تنزيل القالب

source: Upload File
ar: رفع الملف

source: Select File
ar: اختر الملف

source: No file selected
ar: لم يتم اختيار ملف

# uploadSuccess
source: Upload successful
ar: تم الرفع بنجاح

source: Upload failed
ar: فشل الرفع

source: Processing upload...
ar: جاري معالجة الرفع...

# selectComponentTypePlaceholder
source: Select type...
ar: اختر النوع...

source: Component Details
ar: تفاصيل المكون

source: Hierarchy & Relationships
ar: التسلسل الهرمي والعلاقات

source: Management Information
ar: معلومات الإدارة

source: Audit Trail
ar: سجل التدقيق

source: Additional Fields
ar: حقول إضافية

source: Name (English)
ar: الاسم (بالإنجليزية)

source: Name (Arabic)
ar: الاسم (بالعربية)

source: Cost Center
ar: مركز التكلفة

source: Child Components
ar: المكونات الفرعية

source: Hierarchy Path
ar: مسار التسلسل الهرمي

source: Hierarchy Level
ar: مستوى التسلسل الهرمي

source: Last Updated Date
ar: تاريخ آخر تحديث

source: Last Updated By
ar: آخر تحديث بواسطة

source: Established Date
ar: تاريخ التأسيس

source: Registration Number
ar: رقم التسجيل

source: Tax Id
ar: الرقم الضريبي

source: Root Level - No Parent
ar: المستوى الجذري - لا يوجد والد

# noDescription
source: No description provided
ar: لا يوجد وصف

source: Not specified
ar: غير محدد

source: Company Management
ar: إدارة الشركات

# manageCompanyInformation
source: Manage company information and organizational entities
ar: إدارة معلومات الشركة والكيانات التنظيمية

source: Add Company
ar: إضافة شركة

source: Total Companies
ar: إجمالي الشركات

source: Active Companies
ar: الشركات النشطة

source: Total Employees
ar: إجمالي الموظفين

source: Compliant
ar: متوافق

# searchCompaniesPlaceholder
source: Search by company name, code, or registration number...
ar: ابحث باسم الشركة أو الكود أو رقم التسجيل...

source: Edit Company
ar: تعديل الشركة

source: Update Company
ar: تحديث الشركة

# hintCompanyCode
source: Enter company code
ar: أدخل كود الشركة

# hintCompanyNameEnglish
source: Enter company name in English
ar: أدخل اسم الشركة بالإنجليزية

# hintLegalNameEnglish
source: Enter legal name in English
ar: أدخل الاسم القانوني بالإنجليزية

# hintRegistrationNumber
source: Enter registration number
ar: أدخل رقم التسجيل

# hintTaxId
source: Enter tax ID
ar: أدخل الرقم الضريبي

# hintIndustry
source: Enter industry
ar: أدخل الصناعة

# hintCountry
source: Enter country
ar: أدخل الدولة

# hintCity
source: Enter city
ar: أدخل المدينة

# hintAddress
source: Enter full address
ar: أدخل العنوان الكامل

# hintPoBox
source: Enter P.O. Box
ar: أدخل صندوق البريد

# hintZipCode
source: Enter zip code
ar: أدخل الرمز البريدي

# hintPhone
source: Enter phone number
ar: مثال: 2222 2222 965+

# hintEmail
source: Enter email address
ar: مثال: john.smith@company.com

# hintWebsite
source: Enter website URL
ar: أدخل رابط الموقع

# hintTotalEmployees
source: Enter total employees
ar: أدخل إجمالي الموظفين

# hintFiscalYearStart
source: MM-DD
ar: شهر-يوم

source: Company Details
ar: تفاصيل الشركة

source: Contact Information
ar: معلومات الاتصال

# financialAndOperational
source: Financial & Operational
ar: المالية والتشغيلية

source: Established
ar: تاريخ التأسيس

source: Division Management
ar: إدارة الأقسام

# manageDivisionsSubtitle
source: Manage organizational divisions across companies
ar: إدارة الأقسام التنظيمية عبر الشركات

source: Add Division
ar: إضافة قسم

source: Total Divisions
ar: إجمالي الأقسام

source: Active Divisions
ar: الأقسام النشطة

source: Total Budget
ar: إجمالي الميزانية

# searchDivisionsPlaceholder
source: Search by division name, code, or head of division...
ar: البحث حسب اسم القسم أو الرمز أو رئيس القسم...

source: All Companies
ar: جميع الشركات

source: Head
ar: الرئيس

source: emp
ar: موظف

source: depts
ar: أقسام

source: Add New Division
ar: إضافة قسم جديد

source: Edit Division
ar: تعديل القسم

source: Division Code
ar: رمز القسم

source: Division Name (English)
ar: اسم القسم (بالإنجليزية)

source: Division Name (Arabic)
ar: اسم القسم (بالعربية)

source: Head of Division
ar: رئيس القسم

source: Head Email
ar: البريد الإلكتروني للرئيس

source: Head Phone
ar: هاتف الرئيس

source: Business Focus
ar: التركيز التجاري

source: Total Departments
ar: إجمالي الأقسام

source: Annual Budget (KWD)
ar: الميزانية السنوية (دينار كويتي)

# divisionDescription
source: Description
ar: الوصف

source: Create Division
ar: إنشاء القسم

source: Update Division
ar: تحديث القسم

source: Select Company
ar: اختر الشركة

# hintDivisionCode
source: e.g., DIV-FIN
ar: مثال: DIV-FIN

# hintDivisionNameEnglish
source: Division Name
ar: اسم القسم

# hintHeadOfDivision
source: Full Name
ar: الاسم الكامل

# hintLocation
source: Building/Floor
ar: المبنى/الطابق

# hintBusinessFocus
source: e.g., Financial Services
ar: مثال: الخدمات المالية

# hintDivisionDescription
source: Brief description of the division's role and responsibilities
ar: وصف موجز لدور ومسؤوليات القسم

source: Division Details
ar: تفاصيل القسم

source: Leadership
ar: القيادة

source: Organizational Metrics
ar: مقاييس التنظيم

source: Annual Budget
ar: الميزانية السنوية

source: Business Unit Management
ar: إدارة وحدات الأعمال

# manageBusinessUnitsSubtitle
source: Manage business units within divisions
ar: إدارة وحدات الأعمال ضمن الأقسام

source: Add Business Unit
ar: إضافة وحدة أعمال

source: Total Units
ar: إجمالي الوحدات

source: Active Units
ar: الوحدات النشطة

# searchBusinessUnitsPlaceholder
source: Search by business unit name, code, or head...
ar: البحث حسب اسم الوحدة أو الرمز أو الرئيس...

source: All Divisions
ar: جميع الأقسام

source: Focus Area
ar: مجال التركيز

source: Unit Code
ar: رمز الوحدة

source: Unit Name (English)
ar: اسم الوحدة (الإنجليزية)

source: Unit Name (Arabic)
ar: اسم الوحدة (العربية)

source: Head of Unit
ar: رئيس الوحدة

# createBusinessUnit
source: Create Unit
ar: إنشاء وحدة

source: Edit Business Unit
ar: تعديل الوحدة

# updateBusinessUnit
source: Update Unit
ar: تحديث الوحدة

# hintBusinessUnitCode
source: e.g., BU-FIN
ar: مثال: BU-FIN

# hintBusinessUnitName
source: Business Unit Name
ar: اسم الوحدة

# hintSelectDivision
source: Select Division
ar: اختر القسم

# hintHeadOfUnit
source: Full Name
ar: الاسم الكامل

# hintBusinessUnitFocus
source: e.g., Treasury & Investments
ar: مثال: الخزانة والاستثمارات

# hintBusinessUnitDescription
source: Brief description of the business unit
ar: وصف موجز لوحدة الأعمال

source: Business Unit Details
ar: تفاصيل وحدة الأعمال

source: Department Management
ar: إدارة الأقسام

# manageDepartmentsSubtitle
source: Manage departments within business units
ar: إدارة الأقسام ضمن وحدات الأعمال

source: Add Department
ar: إضافة قسم

source: Active Departments
ar: الأقسام النشطة

# totalEmployeesDept
source: Total Employees
ar: إجمالي الموظفين

# totalBudgetDept
source: Total Budget
ar: إجمالي الميزانية

# searchDepartmentsPlaceholder
source: Search by department name, code, or head...
ar: البحث حسب اسم القسم أو الرمز أو الرئيس...

source: All Business Units
ar: جميع وحدات الأعمال

source: Department Focus
ar: مجال التركيز

source: Department Code
ar: رمز القسم

source: Department Name (English)
ar: اسم القسم (بالإنجليزية)

source: Department Name (Arabic)
ar: اسم القسم (بالعربية)

source: Head of Department
ar: رئيس القسم

# hintDepartmentCode
source: e.g., DEPT-TREAS
ar: مثال: DEPT-TREAS

# hintDepartmentNameEnglish
source: Department Name
ar: اسم القسم

# hintBusinessUnit
source: Select Business Unit
ar: اختر وحدة الأعمال

# hintHeadOfDepartment
source: Full Name
ar: الاسم الكامل

# hintDescriptionDepartment
source: Brief description of the department
ar: وصف موجز للقسم

source: Edit Department
ar: تعديل القسم

source: Update Department
ar: تحديث القسم

source: Department Details
ar: تفاصيل القسم

source: Department Leadership
ar: قيادة القسم

source: Department Description
ar: وصف القسم

# departmentBudget
source: Annual Budget (KWD)
ar: الميزانية السنوية (د.ك)

source: Section Management
ar: إدارة الأقسام

# manageSectionsSubtitle
source: Organize and manage organizational sections
ar: تنظيم وإدارة الأقسام التنظيمية

source: Add Section
ar: إضافة قسم

source: Edit Section
ar: تعديل قسم

source: Update Section
ar: تحديث قسم

source: Section Details
ar: تفاصيل القسم

source: Total Sections
ar: إجمالي الأقسام

source: Active Sections
ar: الأقسام النشطة

# totalEmployeesSection
source: Total Employees
ar: إجمالي الموظفين

# totalBudgetSection
source: Total Budget
ar: إجمالي الميزانية

# searchSectionsPlaceholder
source: Search sections...
ar: بحث الأقسام...

# managePositionsJobFamilies
source: Manage positions, job families, levels, and organizational structure
ar: إدارة الوظائف والعائلات الوظيفية والمستويات والهيكل التنظيمي

source: Total Positions
ar: إجمالي الوظائف

source: Filled Positions
ar: الوظائف المشغولة

source: Vacant Positions
ar: الوظائف الشاغرة

source: Fill Rate
ar: معدل الإشغال

source: Positions
ar: الوظائف

source: Job Families
ar: العائلات الوظيفية

source: Add Job Family
ar: إضافة عائلة وظيفية

source: Job Levels
ar: المستويات الوظيفية

source: Job Family Overview
ar: نظرة عامة على العائلة الوظيفية

# jobFamilyStatus
source: Status
ar: الحالة

source: Positions By Level
ar: الوظائف حسب المستوى

# jobFamilyCreated
source: Created
ar: تاريخ الإنشاء

# jobFamilyUpdated
source: Updated
ar: تاريخ التحديث

# noDataMessage
source: No job level data is available for this family.
ar: لا تتوفر بيانات لمستويات هذه العائلة.

source: Job Family Details
ar: تفاصيل العائلة الوظيفية

source: Job Level Details
ar: تفاصيل المستوى الوظيفي

source: Talent Status
ar: حالة المواهب

# jobLevelCode
source: Level Code
ar: رمز المستوى

# salaryRangeSection
source: Salary Range
ar: نطاق الراتب

source: Minimum Salary
ar: الحد الأدنى للراتب

source: Maximum Salary
ar: الحد الأعلى للراتب

source: Median Salary
ar: متوسط الراتب

source: Key Responsibilities
ar: المسؤوليات الرئيسية

source: Progression Path
ar: مسار التقدم

source: Average Tenure
ar: متوسط مدة الخدمة

source: Position Statistics
ar: إحصاءات الوظائف

# enterNameEnglish
source: Enter English name
ar: أدخل الاسم بالإنجليزية

# enterNameArabic
source: Enter Arabic name
ar: أدخل الاسم بالعربية

# positionFamilyDescription
source: Enter description
ar: أدخل الوصف

source: Add New Job Family
ar: إضافة عائلة وظيفية جديدة

source: Job Family Code
ar: رمز العائلة الوظيفية

# jobFamilyCodeHint
source: e.g., JF-001
ar: مثال: JF-001

source: ID
ar: الرمز

source: Auto-generated
ar: يتم إنشاؤه تلقائيًا

source: Job Family Name (English)
ar: اسم العائلة الوظيفية (إنجليزي)

# jobFamilyNameEnglishHint
source: e.g., Finance & Accounting
ar: مثال: المالية والمحاسبة

source: Job Family Name (Arabic)
ar: اسم العائلة الوظيفية (عربي)

source: Create Job Family
ar: إنشاء عائلة وظيفية

source: Edit Job Family
ar: تعديل العائلة الوظيفية

source: Add New Job Level
ar: إضافة مستوى وظيفي جديد

source: Edit Job Level
ar: تعديل المستوى الوظيفي

source: Level Name
ar: اسم المستوى

# levelNameHint
source: e.g., Executive
ar: مثال: تنفيذي

# jobLevelDescriptionHint
source: Describe the level
ar: وصف المستوى

source: Grade Range
ar: نطاق الدرجات

# gradeRangeHint
source: Grade X - Grade Y
ar: الدرجة X - الدرجة Y

# notAvailable
source: N/A
ar: غير متوفر

# defaultJobFamily
source: General
ar: عام

source: Create Job Level
ar: إنشاء مستوى وظيفي

# jobLevelCodeHint
source: e.g., EXEC
ar: مثال: EXEC

source: Code
ar: الرمز

source: Minimum Grade
ar: الحد الأدنى للدرجة

source: Maximum Grade
ar: الحد الأعلى للدرجة

# gradeStructure
source: Grade & Step Structure
ar: هيكل الدرجات والخطوات

source: Reporting Structure
ar: هيكل التقارير

source: Position Tree
ar: شجرة الوظائف

source: Add Position
ar: إضافة وظيفة

source: Edit Position
ar: تعديل الوظيفة

source: Add Job Level
ar: إضافة مستوى وظيفي

source: Add Grade
ar: إضافة درجة

source: Create Grade
ar: إنشاء درجة

source: Edit Grade
ar: تعديل الدرجة

source: Grade Name
ar: اسم الدرجة

# gradeNameHint
source: e.g., Grade A
ar: مثال: الدرجة أ

# gradeDescriptionHint
source: Enter grade description
ar: أدخل وصف الدرجة

source: Grade Steps
ar: خطوات الدرجة

# gradeStepLabelHint
source: Step 1
ar: الخطوة 1

# gradeStepAmountHint
source: SAR 5,000
ar: ٥٠٠٠ ر.س

source: Add Step
ar: إضافة خطوة

source: Grade Number
ar: رقم الدرجة

source: Select Grade
ar: اختر الدرجة

source: Grade Category
ar: فئة الدرجة

source: Entry Level
ar: مستوى المبتدئين

# stepSalaryStructureTitle
source: Step Salary Structure
ar: هيكل الراتب للخطوات

source: Description (Optional)
ar: الوصف (اختياري)

# kdSymbol
source: KD
ar: د.ك

source: Amount
ar: المبلغ

# searchPositionsPlaceholder
source: Search positions by title, code, or Arabic name...
ar: البحث عن الوظائف بالمسمى أو الرمز أو الاسم العربي...

source: All Departments
ar: جميع الأقسام

source: Position Code
ar: رمز الوظيفة

source: Title
ar: المسمى الوظيفي

source: Job Family
ar: العائلة الوظيفية

# jobLevel
source: Level
ar: المستوى

source: Grade/Step
ar: الدرجة/الخطوة

source: Reports To
ar: يقدم تقرير إلى

source: Headcount
ar: عدد الموظفين

source: Vacancy
ar: الشاغر
